In [2]:
import pandas as pd
import numpy as np

In [3]:
obj=pd.Series(np.arange(4.), index=['a','b','c','d'])

In [3]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [4]:
obj['b']

1.0

In [5]:
obj[1]

1.0

In [6]:
obj['b'] is obj[1]

False

In [7]:
obj['b']==obj[1]

True

In [8]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [12]:
obj[2:]

c    2.0
d    3.0
dtype: float64

In [9]:
obj[['b','a','d']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [10]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [11]:
obj[obj<2]

a    0.0
b    1.0
dtype: float64

In [13]:
obj['b':'d']

b    1.0
c    2.0
d    3.0
dtype: float64

In [14]:
obj['b':'c']=5

In [15]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [4]:
data=pd.DataFrame(np.arange(16).reshape((4,4)),
                  index=['Ohio','Colorado','Utah','New York'],
                  columns=['one','two','three','four']
                 )

In [17]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [18]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [19]:
data[['three','one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [20]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [21]:
data[data['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [22]:
data<5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [23]:
data[data<5]=0

In [10]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [11]:
data.loc['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int32

In [12]:
data.iloc[2,[3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [8]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [9]:
data.iloc[[1,2],[3,0,1]]

          four  one  two
Colorado     7    4    5
Utah        11    8    9

In [13]:
data.loc[:'Utah','two']

Ohio        1
Colorado    5
Utah        9
Name: two, dtype: int32

In [14]:
data.iloc[:,:3][data.three>5]

          one  two  three
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14